In [110]:
import pandas as pd
import numpy as np

In [111]:
#Reading indian female names dataset using pandas
female_names = pd.read_csv('Indian-Female-Names.csv', header=0)
female_names

                            name gender    race
0                        shivani      f  indian
1                           isha      f  indian
2                smt shyani devi      f  indian
3                          divya      f  indian
4                          mansi      f  indian
...                          ...    ...     ...
15377                 saroj devi      f  indian
15378              naina @ geeta      f  indian
15379  manju d/0 baboo lal jatav      f  indian
15380                    shivani      f  indian
15381                      nayna      f  indian

[15382 rows x 3 columns]

In [112]:
#Reading indian male names dataset using pandas
male_names = pd.read_csv('Indian-Male-Names.csv', header=0)
male_names

                      name gender    race
0                  barjraj      m  indian
1             ramdin verma      m  indian
2          sharat chandran      m  indian
3          birender mandal      m  indian
4                     amit      m  indian
...                    ...    ...     ...
14840               buddha      m  indian
14841               mukesh      m  indian
14842                 monu      m  indian
14843  govind prasad shahu      m  indian
14844               deepak      m  indian

[14845 rows x 3 columns]

In [113]:
# merging female and male dataset
data = female_names.append(male_names, ignore_index=True)

data

                      name gender    race
0                  shivani      f  indian
1                     isha      f  indian
2          smt shyani devi      f  indian
3                    divya      f  indian
4                    mansi      f  indian
...                    ...    ...     ...
30222               buddha      m  indian
30223               mukesh      m  indian
30224                 monu      m  indian
30225  govind prasad shahu      m  indian
30226               deepak      m  indian

[30227 rows x 3 columns]

In [114]:
#checking for missing data.
data.isna().sum()

name      55
gender     0
race       0
dtype: int64

In [115]:
#rows where name is NAN

def nan(df): 
    return df[df.isna().any(axis=1)]
nan(data)

      name gender    race
217    NaN      f  indian
508    NaN      f  indian
566    NaN      f  indian
605    NaN      f  indian
714    NaN      f  indian
994    NaN      f  indian
1098   NaN      f  indian
1107   NaN      f  indian
1409   NaN      f  indian
1529   NaN      f  indian
2510   NaN      f  indian
2607   NaN      f  indian
2809   NaN      f  indian
3555   NaN      f  indian
3578   NaN      f  indian
3788   NaN      f  indian
3844   NaN      f  indian
4257   NaN      f  indian
4324   NaN      f  indian
5383   NaN      f  indian
5658   NaN      f  indian
5722   NaN      f  indian
6296   NaN      f  indian
6529   NaN      f  indian
6740   NaN      f  indian
7298   NaN      f  indian
10778  NaN      f  indian
10959  NaN      f  indian
10975  NaN      f  indian
12157  NaN      f  indian
14984  NaN      f  indian
15636  NaN      m  indian
16931  NaN      m  indian
17366  NaN      m  indian
17633  NaN      m  indian
18211  NaN      m  indian
18584  NaN      m  indian
18607  NaN      m  indian
18608  NaN      m  indian
18830  NaN      m  indian
19342  NaN      m  indian
19550  NaN      m  indian
19643  NaN      m  indian
19662  NaN      m  indian
19712  NaN      m  indian
19979  NaN      m  indian
19987  NaN      m  indian
20409  NaN      m  indian
20476  NaN      m  indian
20925  NaN      m  indian
22418  NaN      m  indian
22646  NaN      m  indian
27496  NaN      m  indian
29135  NaN      m  indian
30183  NaN      m  indian

In [116]:
#Taking out rows where name is not NAN

data = data[data['name'].notna()]
data

                      name gender    race
0                  shivani      f  indian
1                     isha      f  indian
2          smt shyani devi      f  indian
3                    divya      f  indian
4                    mansi      f  indian
...                    ...    ...     ...
30222               buddha      m  indian
30223               mukesh      m  indian
30224                 monu      m  indian
30225  govind prasad shahu      m  indian
30226               deepak      m  indian

[30172 rows x 3 columns]

In [117]:
#spliting data into train and test
#dividing data into a ratio of 80% training and 20% testing
from sklearn.model_selection import train_test_split

features = data['name'].astype(str)
target = data['gender'].astype(str)

X_train, X_test, y_train, y_test = train_test_split(features, target, random_state=0, test_size=0.2)
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(24137,) (6035,) (24137,) (6035,)

In [118]:
# Extracting features from text files
from sklearn.feature_extraction.text import CountVectorizer
# TF-IDF
from sklearn.feature_extraction.text import TfidfTransformer
# Importing Multinomial Naive Bayes (NB) classifier.
from sklearn.naive_bayes import MultinomialNB

In [119]:
#creating a pipeline
from sklearn.pipeline import Pipeline

text_clf = Pipeline([('vect', CountVectorizer(ngram_range=(1, 1))), ('tfidf', TfidfTransformer(norm='l2', sublinear_tf=True ,use_idf=False)), ('clf', MultinomialNB(alpha=0.1))])

#model training
text_clf = text_clf.fit(X_train, y_train)

In [120]:
from sklearn.metrics import accuracy_score
predicted = text_clf.predict(X_test)
accuracy_score(y_test, predicted)

0.9174813587406794

In [121]:
#Confusion Matrix
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report 

results = confusion_matrix(y_test, predicted)
print(classification_report(y_test, predicted) )

              precision    recall  f1-score   support

           f       0.89      0.96      0.92      3070
           m       0.95      0.87      0.91      2965

    accuracy                           0.92      6035
   macro avg       0.92      0.92      0.92      6035
weighted avg       0.92      0.92      0.92      6035

In [134]:
print("Enter name to predict gender :")
inp=input()
print(text_clf.predict((inp, )))

Enter name to predict gender :
PRAJAKTA
['f']